{
  "truth": [
    "তোমার সবচেয়ে বড় ভয় কী?",
    "তুমি কি কখনো তোমার বন্ধুদের মিথ্যা বলেছো?",
    "তুমি কী সবচেয়ে লজ্জাজনক কাজটি করেছো?",
    "তোমার প্রথম ক্রাশ কে ছিল?",
    "তুমি কি কখনো তোমার মা-বাবার থেকে কোনো গোপন কথা রেখেছো?",
    "তুমি সবচেয়ে খারাপ কোন নম্বর পেয়েছিলে?",
    "এমন কোনো গোপন কথা কী আছে যা তুমি কখনো কাউকে বলোনি?",
    "তুমি কি কখনো পরীক্ষায় নকল করেছো?",
    "তোমার সেলিব্রিটি ক্রাশ কে?",
    "তুমি কি কখনো কোনো বিপদ এড়ানোর জন্য মিথ্যা বলেছো?",
    "তোমার জীবনের সবচেয়ে বড় দুঃখ কী?",
    "তুমি কি কখনো কাউকে ভীষণভাবে ঠকিয়েছো?",
    "কোন গোপন শখ তুমি লুকিয়ে রেখেছো?",
    "তুমি কখনো সত্যি মনে করে কাউকে পছন্দ করনি, কিন্তু প্রকাশ্যে বলেছো?",
    "তুমি কি কখনো কোনো কাজ করার জন্য ভয় পেয়েছো?",
    "তুমি কি কখনো তোমার পরিবারের সদস্যদের দুঃখিত করেছো?",
    "তুমি কি কখনো কিছু করার জন্য এতটাই লজ্জা পেয়েছো যে সেটা কাউকে বলো না?",
    "তুমি কি কখনো তোমার সেরা বন্ধুকে কোনো বড় ভুল পরামর্শ দিয়েছো?",
    "তুমি কি কখনো কাউকে জোর করে কিছু করতে বাধ্য করেছো?",
    "তুমি কি কখনো কোন সম্পর্ককে লুকিয়ে রেখেছো?",
    "তুমি কখনো তোমার মনের মানুষকে সরাসরি বলোনি যে তুমি তাকে পছন্দ করো?",
    "তোমার সবচেয়ে বড় স্বপ্ন কী?",
    "তুমি কি কখনো কাউকে প্রভাবিত করার জন্য মিথ্যা বলেছো?",
    "তুমি কি কখনো কাউকে নিয়ে মজা নেয়ার জন্য কিছু বলেছো?",
    "তুমি কি কখনো কাউকে ঠকানোর জন্য প্ল্যান করেছো?",
    "তোমার জীবনের সবচেয়ে গুরুত্বপূর্ণ মানুষ কে?",
    "তুমি কি কখনো বড় কোনো রিস্ক নিয়েছো?",
    "তুমি কখনো কোনো জিনিস হারিয়ে নিঃসন্দেহে ভেবেছো যে তোমার কপাল খারাপ?",
    "তোমার সবচেয়ে প্রিয় স্মৃতি কোনটি?",
    "তুমি কি কখনো ভুলবশত কাউকে খুব কষ্ট দিয়েছো?",
    "তুমি কি কখনো কাউকে তার ভালবাসার কথা বলোনি?",
    "তুমি কি কখনো কাউকে খুব মিথ্যা বলেছো?",
    "তুমি কি কখনো অন্যের সুবিধা নেওয়ার জন্য কিছু করেছো?",
    "তোমার জীবনের সবচেয়ে বড় অর্জন কী?",
    "তুমি কি কখনো কাউকে শুধুমাত্র অল্প কিছু লাভের জন্য ব্যবহার করেছো?",
    "তোমার সবচেয়ে পছন্দের বই কী?",
    "তুমি কি কখনো মানুষের সামনে খুব অপ্রত্যাশিত কিছু বলেছো?",
    "তুমি কখনো কাউকে ভালোবাসা থেকে ঠকিয়েছো?",
    "তোমার সবচেয়ে প্রিয় গান কী?",
    "তুমি কি কখনো দুঃখ প্রকাশ না করে কাউকে অল্প সময়ের জন্য ছেড়ে গেছো?",
    "তুমি কখনো অন্যদের অনুভূতির প্রতি অত্যন্ত অযত্ন দেখিয়েছো?",
    "তুমি কি কখনো কোনো ভুলের জন্য কাউকে জিজ্ঞাসা না করে নিজের উপর দোষ চাপিয়েছো?",
    "তুমি কি কখনো নিজের কিছু গোপন করার জন্য অন্যদের সঙ্গে কিছু আলোচনা না করেছো?",
    "তুমি কি কখনো কোনো বন্ধুর থেকে নিজের পছন্দের কথা গোপন করেছো?",
    "তুমি কি কখনো কোনো বন্ধু বা আত্মীয়কে খারাপ সময় কাটাতে দেখেছো, কিন্তু কিছুই করনি?",
    "তুমি কি কখনো কাউকে খুব ছোট মনে করেছো?",
    "তুমি কি কখনো খুব গম্ভীর মনোভাব প্রকাশ করে একজন বন্ধু অথবা পারিবারিক সদস্যের সঙ্গে সম্পর্ক নষ্ট করেছো?",
    "তুমি কি কখনো কোনো বড় সিদ্ধান্ত নিতে সময় ভুল সিদ্ধান্ত নিয়েছো?",
    "তুমি কি কখনো অন্যের মনোভাবকে ছোট করে দেখেছো?",
    "তুমি কি কখনো কাউকে সত্যি বলতে ভয় পেয়েছো?"
  ],
  "dare": [
    "তোমার প্রিয় গানটির কোরাস জোরে গেয়ে শোনাও!",
    "২০টি জাম্পিং জ্যাক করো!",
    "এক চামচ সরিষার মাখন খাও!",
    "কোনো সেলিব্রিটির মতো অভিনয় করো, যতক্ষণ না কেউ বুঝতে পারে তুমি কে।",
    "একটি লজ্জাজনক ছবি সোশ্যাল মিডিয়ায় পোস্ট করো!",
    "১ মিনিট ধরে কোনো সঙ্গীত ছাড়া নাচ করো!",
    "কাউকে ৩০ সেকেন্ড ধরে তোমার পিঠে খোঁচানো দিতে দাও!",
    "আরেকজন প্লেয়ারকে নকল করো!",
    "কাউকে তোমার মুখে কলম দিয়ে আঁকতে দাও!",
    "তোমার কনুই লিক করার চেষ্টা করো!",
    "এক মিনিট ধরে এক পা দিয়ে দাঁড়িয়ে থেকো!",
    "চা/কফি না খেয়ে ৫ মিনিটের জন্য শুয়ে থাকো!",
    "তুমি কি তোমার প্রিয় বন্ধুর গলায় গান গাওয়ার চ্যালেঞ্জ নিতে পারো?",
    "বাহুত কমফোর্টেবল পজিশন করে থাকতে হবে!",
    "এক মিনিট সবার সামনে বড় বড় শব্দে হাসো!",
    "যে কোনো খাবারের সাথে ১ চামচ লেবুর রস মিশিয়ে খাও!",
    "তোমার পায়ের স্লিপার উল্টো করে পরে নাচো!",
    "এখন তোমার বন্ধুর সাথে বক্সিং ম্যাচ করো!",
    "তোমার হাতের পেছনের অংশে ৩০ সেকেন্ড ধরে মিউজিক বাজাও!",
    "দেড় মিনিট ধরে কোনো ডান্স স্টেপ করো!",
    "৫ মিনিটে একাধিক সেলফি নিয়ে শেয়ার করো!",
    "অন্য কাউকে ৩০ সেকেন্ডের জন্য তোমার মোবাইলের পাসওয়ার্ড দিন!",
    "নিজের মুখে ১০ সেকেন্ড জ্বালানী মাখাও!",
    "তোমার মুখের পাশে একটানা দাড়ি রাখো ২ মিনিট!",
    "নিজের প্রিয় খাবার একবার সবার সামনে খেয়ে দেখাও!",
    "একটি চুম্বন আলাদার পেতে গোপন মেজাজ সৃষ্টি করো!",
    "অন্যকে চমকানোর জন্য বলো যে তুমি কী কাজ করছো!"
  ]
}
